In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('../data/2016/DistinguishedService3.csv')
print df.shape
df.head()

(68, 9)

   Place  Ag Sex  St      Time  Pace FIRST_NAME   LAST_NAME member
0      1  24   M  NY  00:48:35  6:05       Eric       Young    yes
1      2  26   M  NY  00:50:54  6:22        Ben      Heller    yes
2      3  43   M  NY  00:52:18  6:33        Bob       Irwin    yes
3      4  34   M  NY  00:52:19  6:33      Chuck       Terry    yes
4      5  52   M  NY  00:52:21  6:33       Mark  Stephenson    yes

In [28]:
hmrrc=df[df['member']=='yes']
print hmrrc.shape

(64, 9)

In [29]:
hmrrc=hmrrc[['Place','FIRST_NAME','LAST_NAME','Sex','Ag']]
hmrrc.head()

   Place FIRST_NAME   LAST_NAME Sex  Ag
0      1       Eric       Young   M  24
1      2        Ben      Heller   M  26
2      3        Bob       Irwin   M  43
3      4      Chuck       Terry   M  34
4      5       Mark  Stephenson   M  52

In [34]:
hmrrc=hmrrc.sort_values(['Sex','Ag','Place'])

In [35]:
hmrrc.head()

    Place FIRST_NAME  LAST_NAME Sex  Ag
23      3     Hannah  Gallagher   F  15
21      2       Alex   Thompson   F  16
27      4     Meghan  Mortensen   F  30
17      1  Elizabeth    Chauhan   F  31
46     12     Meleah     Wright   F  34

In [49]:
def AgeToCat(age):
    if (0<age<30):
        return "a_open"
    if (30<=age<40):
        return "b_30_39"
    if (40<=age<50):
        return "c_40_49"
    if (50<=age<60):
        return "d_50_59"
    if (60<=age<70):
        return "e_60_69"
    if (age>=70):
        return "f_70+"

In [50]:
hmrrc["age_cat"]=hmrrc.Ag.apply(lambda x:AgeToCat(x))
hmrrc.head()

    Place FIRST_NAME  LAST_NAME Sex  Ag  age_cat               name
21      2       Alex   Thompson   F  16   a_open      Alex Thompson
23      3     Hannah  Gallagher   F  15   a_open   Hannah Gallagher
17      1  Elizabeth    Chauhan   F  31  b_30_39  Elizabeth Chauhan
27      4     Meghan  Mortensen   F  30  b_30_39   Meghan Mortensen
37      9    Larissa      Bates   F  35  b_30_39      Larissa Bates

In [51]:
hmrrc=hmrrc.sort_values(['Sex','age_cat','Place'])
hmrrc.head()

    Place FIRST_NAME  LAST_NAME Sex  Ag  age_cat               name
21      2       Alex   Thompson   F  16   a_open      Alex Thompson
23      3     Hannah  Gallagher   F  15   a_open   Hannah Gallagher
17      1  Elizabeth    Chauhan   F  31  b_30_39  Elizabeth Chauhan
27      4     Meghan  Mortensen   F  30  b_30_39   Meghan Mortensen
37      9    Larissa      Bates   F  35  b_30_39      Larissa Bates

In [52]:
hmrrc['name']=hmrrc.FIRST_NAME+" "+hmrrc.LAST_NAME
hmrrc.head()

    Place FIRST_NAME  LAST_NAME Sex  Ag  age_cat               name
21      2       Alex   Thompson   F  16   a_open      Alex Thompson
23      3     Hannah  Gallagher   F  15   a_open   Hannah Gallagher
17      1  Elizabeth    Chauhan   F  31  b_30_39  Elizabeth Chauhan
27      4     Meghan  Mortensen   F  30  b_30_39   Meghan Mortensen
37      9    Larissa      Bates   F  35  b_30_39      Larissa Bates

In [53]:
hmrrc.to_csv('../data/2016/DistinguishedServiceScored.csv')